app/views/dashboard/index.html.erb

    <tr>
      <td><%= @products.find(userproduct.product_id).name %></td>
---
SELECT `products`.* FROM `products` INNER JOIN `user_products` ON `products`.`id` = `user_products`.`product_id` WHERE `user_products`.`user_id` = 1