app/controllers/admin/products_controller.rb

SELECT `contents`.* FROM `contents` WHERE `contents`.`product_id` = 2
---
  def show
    @contents = Content.rank(:row_order).where(:product_id => params[:id]).roots

SELECT `contents`.* FROM `contents` WHERE `contents`.`product_id` = 4
SELECT  1 AS one FROM `users` INNER JOIN `user_products` ON `users`.`id` = `user_products`.`user_id` WHERE `user_products`.`product_id` = 2 LIMIT 1
SELECT `users`.`email` FROM `users` INNER JOIN `user_roles` ON `user_roles`.`user_id` = `users`.`id` INNER JOIN `roles` ON `roles`.`id` = `user_roles`.`role_id` WHERE (roles.name = 'Product Manager')
---
  def edit
    @contents = Content.all
    @product_managers = @product.users.pluck(:email) unless @product.users.empty?

INSERT INTO `products` (`title`, `created_at`, `updated_at`, `visibility`) VALUES ('My Widget', '2016-10-08 19:11:28', '2016-10-08 19:11:28', 'All')
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

SELECT `user_products`.* FROM `user_products` WHERE `user_products`.`product_id` = 2
---
    def set_product
      @product = Product.find(params[:id])