app/views/admin/index.html.erb

<pre>
  <%=
  @Comp = User.find_by(id: session[:user_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1