app/controllers/contents_controller.rb

SELECT `contents`.* FROM `contents`
---
  def index
    @contents = Content.all