app/controllers/dashboard_controller.rb

SELECT `user_products`.* FROM `user_products`
---
  def dashboard
      @products = Product.all