app/controllers/dashboard_controller.rb

SELECT `products`.* FROM `products` WHERE `products`.`visibility` IN ('All', 'Registered Users')
---
  def index
      if current_user
        @products = Product.where(visibility: [Product::VISIBILITY_ALL, Product::VISIBILITY_REGISTERED_USERS])