app/controllers/products_controller.rb

INSERT INTO `products` (`name`, `created_at`, `updated_at`) VALUES ('MyString', '2016-08-16 21:49:13', '2016-08-16 21:49:13')
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save