app/controllers/sessions_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`name` = 'admin' LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
---
  def create
    user = User.find_by(name: params[:name])
    user_id = User.find_by(id: session[:user_id])