app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `password_digest`, `created_at`, `updated_at`) VALUES ('ram', '$2a$10$WfiZF9Tq8ExS8KbtR87K7ODzFV9E9RYjzbTZ09WgEbQEEAyymluSm', '2016-07-20 00:24:18', '2016-07-20 00:24:18')

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `name` = 'Pratik', `password_digest` = '$2a$04$DlW8DeY/xSuyaNQQn6rlReGAFAy5IFK9aO4WMKLBE2P55V2XhE9Em', `updated_at` = '2016-08-01 21:54:42' WHERE `users`.`id` = 190

  def makeadmin
    @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1