app/controllers/user_products_controller.rb

SELECT `user_products`.* FROM `user_products`
---
  def index
    @user_products = UserProduct.all